tap "nikitabobko/tap"
brew "act"
brew "libpng"
brew "freetype"
brew "glib"
brew "cairo"
brew "coreutils"
brew "dep-tree"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "git-lfs"
brew "graphviz"
brew "hdf5"
brew "htop"
brew "imagemagick"
brew "jpeg"
brew "libffi"
brew "libxaw"
brew "node"
brew "marp-cli"
brew "netcdf"
brew "ncview"
brew "neovim"
brew "node@20"
brew "nox"
brew "ollama"
brew "pandoc"
brew "pixi"
brew "poppler"
brew "powerlevel10k"
brew "pre-commit"
brew "rattler-build"
brew "ripgrep"
brew "ruff"
brew "sonar-scanner"
brew "starship"
brew "tokei"
brew "tree"
brew "uv"
brew "virtualenv"
brew "yarn"
brew "yt-dlp"
brew "zlib"
cask "aerospace"
cask "alt-tab"
cask "rectangle"
cask "stretchly"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "darkriszty.markdown-table-prettify"
vscode "docker.docker"
vscode "ecmel.vscode-html-css"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hoovercj.vscode-power-mode"
vscode "james-yu.latex-workshop"
vscode "johnpapa.vscode-peacock"
vscode "ktnrg45.vscode-cython"
vscode "lextudio.restructuredtext"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "mervin.markdown-formatter"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mutantdino.resourcemonitor"
vscode "njpwerner.autodocstring"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pdconsec.vscode-print"
vscode "pkief.material-icon-theme"
vscode "quarto.quarto"
vscode "redhat.vscode-yaml"
vscode "remcohaszing.schemastore"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "trond-snekvik.simple-rst"
vscode "tyriar.lorem-ipsum"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
cargo "maturin"
cargo "mdbook"
cargo "rustlings"
